INSERT INTO tz_roles (id, rName) VALUES
( 0, 'Администратор'),
( 1, 'Директор'),
( 2, 'Завуч'),
( 3, 'Сотрудник'),
( 4, 'Учитель'),
( 5, 'Ученик'),
( 6, 'Родитель'),
( 7, 'Гость');

INSERT INTO tz_worktypes (wtName) VALUES
('Работа на уроке'), ('Домашняя работа'), ('Самостоятельная работа'), ('Контрольная работа');

INSERT INTO tz_settings (id, ssDayStarts, ssDayEnds, ssLessonLength, ssBreakLength, ssBigBreakLength, ssOperatorName, ssOperatorEmail, ssThisHost) VALUES
(1,'08:30:00','14:00',40,5,15,'Григоряном Арой Коляевичем','aartur200@gmail.com','http://84.201.136.240:9040');

INSERT INTO tz_years (year1,year2,yStarts,yEnds) VALUES
(2020,2021,'2020-09-01','2021-05-31');
INSERT INTO tz_trimesters (id_year, trNumber, trStarts, trEnds) VALUES
(2020,1,'2020-09-01','2020-11-15'),
(2020,2,'2020-12-01','2021-02-15'),
(2020,3,'2021-03-01','2021-05-20');

INSERT INTO tz_media (id, mMimeType) VALUES (0, 'image/jpeg');

INSERT INTO tz_actors (aLogin, aPass, aName, aBirthDate, aSex, aPhone, aEmail, aActivated, aFcmToken) VALUES
('dba', 'AB4154A7C451F56E9B7FF1537758DDD0C619F8BE', 'Администратор системы', '1984-10-15', 'M', '+79621671681', 'velesov7493@yandex.ru', 1, null),
('tpDirector', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Иванов Иван Иванович', '1980-11-11', 'M', '+79621671660', 'iv1000@yandex.ru', 1, null),
('tpZavuch', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Петрова Мария Павловна', '1980-10-11', 'F', '+79621671661', 'iv1001@yandex.ru', 1, null),
('tpZavhoz', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Сидоров Петр Павлович', '1980-09-11', 'M', '+79621671662', 'iv1002@yandex.ru', 1, null),
('tpUchitel1', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Макаренко Светлана Павловна', '1970-09-11', 'F', '+79621671663', 'iv1003@yandex.ru', 1, null),
('tpUchitel2', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Макаренко Леонид Иванович', '1966-09-11', 'M', '+79621671664', 'iv1004@yandex.ru', 1, null),
('tpUchitel3', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Курицына Галина Николаевна', '1960-09-11', 'F', '+79621671760', 'iv1005@yandex.ru', 1, null),
('tpUchitel4', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Смирнова Светлана Николаевна', '1960-09-11', 'F', '+79621671761', 'iv1006@yandex.ru', 1, null),
('tpUchitel5', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Коробов Валерий Юрьевич', '1960-09-11', 'F', '+79621671762', 'iv1007@yandex.ru', 1, null),
('tpUchitel6', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Скосорева Зинаида Анатольевна', '1980-09-11', 'F', '+79621671763', 'iv1008@yandex.ru', 1, null),
('tpUchitel7', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Федоренко Татьяна', '1980-09-11', 'F', '+79621671764', 'iv1009@yandex.ru', 1, null),
('tpUchitel8', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Метлина Светлана Анатольевна', '1980-09-11', 'F', '+79621671765', 'iv1010@yandex.ru', 1, null),
('tpUchitel9', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Блинов Вениамин Проклович', '1980-09-11', 'М', '+79621671766', 'iv1011@yandex.ru', 1, null),
('tpUchitel10', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Шашков Юстиниан Станиславович', '1980-09-11', 'М', '+79621671767', 'iv1012@yandex.ru', 1, null),
('tpUchitel11', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Виноградов Матвей Васильевич', '1980-09-11', 'М', '+79621671768', 'iv1013@yandex.ru', 1, null),
('tpUchitel12', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Виноградов Матвей Васильевич', '1980-09-11', 'М', '+79621671768', 'iv1014@yandex.ru', 1, null),
('tpUchitel13', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Юдина Беатриса Еремеевна', '1980-09-11', 'F', '+79621671769', 'iv1015@yandex.ru', 1, null),
('tpUchitel14', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Стрелкова Марфа Романовна', '1980-09-11', 'F', '+79621671790', 'iv1016@yandex.ru', 1, null),
('tpUchitel15', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Баранова Женевьева Игоревна', '1980-09-11', 'F', '+79621671791', 'iv1017@yandex.ru', 1, null),
('tpUchitel16', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Рыбакова Эльза Якуновна', '1981-09-11', 'F', '+79621671791', 'iv1018@yandex.ru', 1, null),
('tpStudent1', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Разумова Наталья Александровна', '2004-09-11', 'F', '+79621671771', 'iv1019@yandex.ru', 1, null),
('tpStudent2', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Токарева Мария Валерьевна', '2004-11-11', 'F', '+79621671775', 'iv1020@yandex.ru', 1, null),
('tpStudent3', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Касаткина Виктория Викторовна', '2004-10-10', 'F', '+79621671776', 'iv1021@yandex.ru', 1, null),
('tpStudent4', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Семенович Анна Михайловна', '2004-10-10', 'F', '+79621671777', 'iv1022@yandex.ru', 1, null),
('tpStudent5', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Кардашьян Ким Фредовна', '2004-10-10', 'F', '+79621671871', 'iv1023@yandex.ru', 1, null),
('tpParent1', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Разумов Александр Константинович', '1959-10-10', 'M', '+79621671769', 'iv1024@yandex.ru', 1, null),
('tpParent2', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Разумова Светлана Леонидовна', '1960-10-10', 'F', '+79621671970', 'iv1025@yandex.ru', 1, null),
('tpParent3', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Токарев Валерий Викторович', '1959-10-10', 'M', '+79621671768', 'iv1026@yandex.ru', 1, null),
('tpParent4', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Токарева Любовь Геннадьевна', '1965-10-10', 'F', '+79621671767', 'iv1027@yandex.ru', 1, null),
('tpParent5', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Касаткин Виктор Викторович', '1966-10-10', 'M', '+79621671766', 'iv1028@yandex.ru', 1, null),
('tpParent6', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Касаткина Наталья Павловна', '1967-10-10', 'F', '+79621671765', 'iv1029@yandex.ru', 1, null),
('tpParent7', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Семенович Михаил Алексеевич', '1966-10-10', 'M', '+79621671764', 'iv1030@yandex.ru', 1, null),
('tpParent8', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Семенович Мария Сергеевна', '1967-10-10', 'F', '+79621671763', 'iv1031@yandex.ru', 1, null),
('tpParent9', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Кардашьян Фред Дональдович', '1966-10-10', 'M', '+79621671762', 'iv1032@yandex.ru', 1, null),
('tpParent10', '3D4F2BF07DC1BE38B20CD6E46949A1071F9D0E3D', 'Кардашьян Изабель Томасовна', '1967-10-10', 'F', '+79621671761', 'iv1033@yandex.ru', 1, null);

INSERT INTO tz_professions (pName) VALUES
('Системный администратор'),
('Директор'),
('Завуч'),
('Завхоз'),
('Охранник');

INSERT INTO tz_disciplines (dName, dMinClassNum, dMaxClassNum) VALUES
('Математика',1,6), ('Русский язык',1,11), ('Труд', 5,9),
('Литературное чтение',1,4), ('Физическая культура',1,11), ('Технология',1,4), 
('Окружающий мир',1,4), ('ИЗО',1,9), ('Музыка',1,11), ('Английский язык',2,11),
('Немецкий язык',2,11), ('Китайский язык',2,11), ('ОРКСЭ',4,4),
('История',5,11), ('Биология',5,11), ('Литература',5,11),
('География',5,9), ('Обществознание',5,11), ('Информатика',5,11),
('Алгебра',7,11), ('Геометрия',7,11), ('ОБЖ',7,11),
('Физика',7,11), ('Химия',8,11), ('Правоведение',10,11);

INSERT INTO tz_chatrooms (is_public, access_ring, id_class, id_actor1, id_actor2, ctName, ctLastMessage) VALUES
(1,5,1,null,null,'Ученический чат 1А',null),(1,6,1,null,null,'Родительский чат 1А',null),
(1,5,2,null,null,'Ученический чат 1Б',null),(1,6,2,null,null,'Родительский чат 1Б',null),
(1,5,3,null,null,'Ученический чат 2А',null),(1,6,3,null,null,'Родительский чат 2А',null),
(1,5,4,null,null,'Ученический чат 2Б',null),(1,6,4,null,null,'Родительский чат 2Б',null),
(1,5,5,null,null,'Ученический чат 3А',null),(1,6,5,null,null,'Родительский чат 3А',null),
(1,5,6,null,null,'Ученический чат 3Б',null),(1,6,6,null,null,'Родительский чат 3Б',null),
(1,5,7,null,null,'Ученический чат 4А',null),(1,6,7,null,null,'Родительский чат 4А',null),
(1,5,8,null,null,'Ученический чат 4Б',null),(1,6,8,null,null,'Родительский чат 4Б',null),
(1,5,9,null,null,'Ученический чат 5А',null),(1,6,9,null,null,'Родительский чат 5А',null),
(1,5,10,null,null,'Ученический чат 5Б',null),(1,6,10,null,null,'Родительский чат 5Б',null),
(1,5,11,null,null,'Ученический чат 6А',null),(1,6,11,null,null,'Родительский чат 6А',null),
(1,5,12,null,null,'Ученический чат 6Б',null),(1,6,12,null,null,'Родительский чат 6Б',null),
(1,5,13,null,null,'Ученический чат 7А',null),(1,6,13,null,null,'Родительский чат 7А',null),
(1,5,14,null,null,'Ученический чат 7Б',null),(1,6,14,null,null,'Родительский чат 7Б',null),
(1,5,15,null,null,'Ученический чат 8А',null),(1,6,15,null,null,'Родительский чат 8А',null),
(1,5,16,null,null,'Ученический чат 8Б',null),(1,6,16,null,null,'Родительский чат 8Б',null),
(1,5,17,null,null,'Ученический чат 9А',null),(1,6,17,null,null,'Родительский чат 9А',null),
(1,5,18,null,null,'Ученический чат 9Б',null),(1,6,18,null,null,'Родительский чат 9Б',null),
(1,5,19,null,null,'Ученический чат 10А',null),(1,6,19,null,null,'Родительский чат 10А',null),
(1,5,20,null,null,'Ученический чат 10Б',null),(1,6,20,null,null,'Родительский чат 10Б',null),
(1,5,21,null,null,'Ученический чат 11А',null),(1,6,21,null,null,'Родительский чат 11А',null),
(1,5,22,null,null,'Ученический чат 11Б',null),(1,6,22,null,null,'Родительский чат 11Б',null),
(1,4,null,null,null,'Чат сотрудников и учителей школы',null);

INSERT INTO tz_classes (id_leader, id_pchat, id_schat, cStudentsCount, cNumber, cLiter, cCreated, cIssued) VALUES
(5,2,1,5,1,'А','2020-08-26',null),(5,4,3,0,1,'Б','2020-08-26',null),
(6,6,5,5,2,'А','2020-08-26',null),(6,8,7,0,2,'Б','2020-08-26',null),
(7,10,9,5,3,'А','2020-08-26',null),(7,12,11,0,3,'Б','2020-08-26',null),
(8,14,13,5,4,'А','2020-08-26',null),(8,16,15,0,4,'Б','2020-08-26',null),
(9,18,17,5,5,'А','2020-08-26',null),(9,20,19,0,5,'Б','2020-08-26',null),
(10,22,21,5,6,'А','2020-08-26',null),(10,24,23,0,6,'Б','2020-08-26',null),
(11,26,25,5,7,'А','2020-08-26',null),(12,28,27,0,7,'Б','2020-08-26',null),
(13,30,29,5,8,'А','2020-08-26',null),(14,32,31,0,8,'Б','2020-08-26',null),
(15,34,33,5,9,'А','2020-08-26',null),(16,36,35,0,9,'Б','2020-08-26',null),
(17,38,37,5,10,'А','2020-08-26',null),(18,40,39,0,10,'Б','2020-08-26',null),
(19,42,41,5,11,'А','2020-08-26',null),(20,44,43,0,11,'Б','2020-08-26',null);

/* Сотрудники */
INSERT INTO tr_actorstats (id_actor, id_role, id_profession, id_discipline, id_class, id_father, id_mother, id_child, sName) VALUES
(1,0,1,null,null,null,null,null,'Администратор системы'),
(2,1,2,null,null,null,null,null,'Директор школы'),
(3,2,3,null,null,null,null,null,'Завуч'),
(4,3,4,null,null,null,null,null,'Завхоз'),
(4,3,5,null,null,null,null,null,'Охранник'),
/* Учителя */
(5,4,null,null,1,null,null,null,'Учитель младших классов (1А)'),
(5,4,null,null,2,null,null,null,'Учитель младших классов (1Б)'),
(6,4,null,null,3,null,null,null,'Учитель младших классов (2А)'),
(6,4,null,null,4,null,null,null,'Учитель младших классов (2Б)'),
(7,4,null,null,5,null,null,null,'Учитель младших классов (3А)'),
(7,4,null,null,6,null,null,null,'Учитель младших классов (3Б)'),
(8,4,null,null,7,null,null,null,'Учитель младших классов (4А)'),
(8,4,null,null,8,null,null,null,'Учитель младших классов (4Б)'),
(9,4,null,1,null,null,null,null,'Преподаватель математики'),
(10,4,null,2,null,null,null,null,'Преподаватель русского языка'),
(4,4,null,3,null,null,null,null,'Преподаватель труда'),
/* Ученики */
(21,5,null,null,1,26,27,null,'Ученик'),
(22,5,null,null,1,28,29,null,'Ученик'),
(23,5,null,null,1,30,31,null,'Ученик'),
(24,5,null,null,1,32,33,null,'Ученик'),
(25,5,null,null,1,34,35,null,'Ученик'),
/* Родители */
(26,6,null,null,1,null,null,21,'Родитель'), (27,6,null,null,1,null,null,21,'Родитель'),
(28,6,null,null,1,null,null,22,'Родитель'), (29,6,null,null,1,null,null,22,'Родитель'),
(30,6,null,null,1,null,null,23,'Родитель'), (31,6,null,null,1,null,null,23,'Родитель'),
(32,6,null,null,1,null,null,24,'Родитель'), (33,6,null,null,1,null,null,24,'Родитель'),
(34,6,null,null,1,null,null,25,'Родитель'), (35,6,null,null,1,null,null,25,'Родитель');

/* Новости */

INSERT INTO tz_news (id_media, nTime, nCaption, nText) VALUES
(null,'2020-10-25T10:00:00+03:00','Заголовок новости 1','Содержимое новости 1. Содержимое новости 1. Содержимое новости 1.'),
(null,'2020-10-25T11:00:00+03:00','Заголовок новости 2','Содержимое новости 2. Содержимое новости 2. Содержимое новости 2.'),
(null,'2020-10-25T12:00:00+03:00','Заголовок новости 3','Содержимое новости 3. Содержимое новости 3. Содержимое новости 3.');

/* Уроки */

INSERT INTO tz_lessons (id_teacher, id_class, id_discipline, lDescription, lDate, lStarts, lEnds, lCabinetNum) VALUES
(9,5,1,'Математика для 3-А','2020-09-14','08:30:00','09:10:00',7),
(9,6,1,'Математика для 3-Б','2020-09-14','09:25:00','10:05:00',7),
(10,5,2,'Русский язык для 3-А','2020-09-14','10:10:00','10:50:00',11),
(10,6,2,'Русский язык для 3-Б','2020-09-14','10:55:00','11:35:00',11);